// 5. Написати програму, яка визначає, чи є матриця 6×6 магічним квадратом, у якому суми
// елементів у всіх рядках і стовпчиках та на діагоналі однакові. При створенні масивів
// використати конструктор для заповнення матриці 6×6 числами магічного квадрату та
// лінійних масивів нулями:
let a = [
  [27, 29, 2, 4, 13, 36],
  [9, 11, 20, 22, 31, 18],
  [32, 25, 7, 3, 21, 23],
  [14, 16, 34, 30, 12, 5],
  [28, 6, 15, 17, 26, 19],
  [1, 24, 33, 35, 8, 10]];
let r = [0, 0, 0, 0, 0, 0];
let l = [0, 0, 0, 0, 0, 0];
let d = [0, 0];


for (let i = 0; i < 6; i++) {
  for (let j = 0; j < 6; j++) {
    r[i] += a[i][j]; // 27
    l[j] += a[i][j]; //
    console.log('i-j=', i + '-' + j)
    console.log('r[i] = ', r[i])
    console.log('l[j] = ', l[j])
    if (i === j) {
      d[0] += a[i][j];
      console.log('d[0] = ', d[0])
    }
    if (i + j === 5) {
      d[1] += a[i][j];
      console.log('d[1] = ', d[1])
    }
    console.log(' ====== ')
  }
}

console.log('r = ', r)
console.log('l = ', l)
console.log('d = ', d)

const isMagic = r.every(val => val === r[0]) && l.every(val => val === l[0]) && (d[0] === d[1]) && (d[0] === r[0]);


console.log(`The matrix is a magic square: ${isMagic}`);
