// // Потрібно написати функцію, яка відповідає таким вимогам:
// //   Функція приймає два аргументи - масив з унікальних цілих чисел і суму у вигляді цілого
// // числа. Якщо сума двох будь-яких чисел масиву з одного аргументу дорівнює числу, яке
// // приходить 2-м аргументом, функція повинна повернути новий масив із цих двох чисел у
// // будь-якому порядку. Якщо рішення немає, повернути пустий масив.
// //   Отже, ми маємо вихідний масив myNumbers і ціле число sum:
// const myNumbers = [3, 5, -4, 8, 11, 1, -1, 6];
// const sum = 10;
// // Результат роботи нашої функції повинен мати такий формат:
// // [-1, 11] або [11, -1] - оскільки -1 + 11 = 10;
//
// const findPairs = (array, targetSum) => {
//   const result = []
//   myNumbers.forEach((number, index) => {
//     let tmp = targetSum - number
//     if()
//   })
//
// }


const size = 5
console.log(" ".repeat(size - 1) + "*");
for (let i = 1; i < size; i++) {
  if (i === (size - 1) / 2) {
    console.log(" ".repeat((size - 1) / 2) + "*".repeat(size))
  } else {
    let spacesInside = 2 * i - 1;
    console.log(" ".repeat(size - 1 - i) + "*" + " ".repeat(spacesInside) + "*");
  }

}
